---
title: STLExportOptions
classe: Autodesk.Revit.DB.STLExportOptions
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.BIMExportOptions
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 16
---

# STLExportOptions

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean ExportBinary { get; set; }` | `sTLExportOptions.ExportBinary` | Boolean |
| `Boolean ExportColor { get; set; }` | `sTLExportOptions.ExportColor` | Boolean |
| `Double GridAspectRatio { get; set; }` | `sTLExportOptions.GridAspectRatio` | Double |
| `Double MaxEdgeLength { get; set; }` | `sTLExportOptions.MaxEdgeLength` | Double |
| `Double NormalTolerance { get; set; }` | `sTLExportOptions.NormalTolerance` | Double |
| `Double SurfaceTolerance { get; set; }` | `sTLExportOptions.SurfaceTolerance` | Double |
| `ExportUnit TargetUnit { get; set; }` | `sTLExportOptions.TargetUnit` | ExportUnit |
| `Boolean IsGridAspectRatioSet()` | `sTLExportOptions.IsGridAspectRatioSet()` | Boolean |
| `Boolean IsMaxEdgeLengthSet()` | `sTLExportOptions.IsMaxEdgeLengthSet()` | Boolean |
| `Boolean IsNormalToleranceSet()` | `sTLExportOptions.IsNormalToleranceSet()` | Boolean |
| `Boolean IsSurfaceToleranceSet()` | `sTLExportOptions.IsSurfaceToleranceSet()` | Boolean |
| `Boolean IsValidForGridAspectRatio(Double)` | `STLExportOptions.IsValidForGridAspectRatio(value)` | Boolean |
| `Boolean IsValidForMaxEdgeLength(Double)` | `STLExportOptions.IsValidForMaxEdgeLength(value)` | Boolean |
| `Boolean IsValidForNormalTolerance(Double)` | `STLExportOptions.IsValidForNormalTolerance(value)` | Boolean |
| `Boolean IsValidForSurfaceTolerance(Double)` | `STLExportOptions.IsValidForSurfaceTolerance(value)` | Boolean |
| `Void SetTessellationSettings(ExportResolution)` | `sTLExportOptions.SetTessellationSettings(resolutionType)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```